#include <iostream>
#include <stdlib.h>  // استعملتها عشان يشتغل الراندوم
#include <ctime> // مكتبة للوقت


using namespace std;

    
int main()
{       
    srand(time(0)) // هاي بتغير الارقام العشوائية بكل مرة بعمل رن والتايم عبارة عن مؤقت عشان الارقام تضل تتغير 
    cout << rand()%10;  //  هاي الداله الي بتطبع ارقام عشوائية وحطيت المود عشان اخذ ارقام اصغر من 10 مثلا لانه المود دايما نتيجته اقل من العدد الثاني

    // عشان اطبع ارقام عشوائية واحصرهم بين رقمين محددين 
    // مثلا بدي اطبع ارقام عشوائية بين 30 و 40
    // في قاعدة 
    // start + rand()%(end - start + 1)
    //   30  + rand()%( 40 -   30  + 1)  

    //cout <<rand()%40  ;
    return 0;


}

